
import event from '../shared/assets/event.png'

export default class fake{

    static getEvents(){
        const data = [
            {
                title: "Название",
                image: "",
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
        ]
        return data;
    }

    static getRecentEvents(){
        const data = [
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
            {
                title: "Название",
                image: event,
                tags: ["тег", "другой тег", "тег", "тег"],
                description: "Описание описание описание описание описание описаниеописаниеописаниеописаниеописаниеописаниеописаниеописание описание описаниеописаниеописаниеописаниеописаниеоfmdklmkds",
                isFavorite: false,
            },
        ]

        return data;
    }

}